aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx71m/r_s12ad_rx71m.c
    if (g_dcb[unit].opened == true)
    {
        return ADC_ERR_AD_NOT_CLOSED;
    }
    if (R_BSP_HardwareLock(ADC_LOCK(unit)) == false)
    {
        return ADC_ERR_AD_LOCKED;
    }


    /* APPLY POWER TO PERIPHERAL */

    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    if (unit == 0)
    {
        MSTP(S12AD) = 0;
    }
    else
    {
        MSTP(S12AD1) = 0;
    }
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    p_regs = GET_REGS_PTR(unit);
    p_regs->ADCSR.WORD = 0;
    if (unit == 1)
    {
        S12AD1.ADEXICR.WORD = 0;
    }

    p_regs->ADANSA0.WORD = 0;
    p_regs->ADANSB0.WORD = 0;
    p_regs->ADADS0.WORD = 0;

    if (unit == 1)  /* These register are only in channel1 */
    {
        p_regs->ADANSA1.WORD = 0;
        p_regs->ADANSB1.WORD = 0;
        p_regs->ADADS1.WORD = 0;
    }
    
    p_regs->ADADC.BYTE = 0;
    
    p_regs->ADCER.WORD = 0;
    p_regs->ADSTRGR.WORD = 0;

    p_regs->ADSSTR0 = 0x0b;
    p_regs->ADSSTR1 = 0x0b;
    p_regs->ADSSTR2 = 0x0b;
    p_regs->ADSSTR3 = 0x0b;
    p_regs->ADSSTR4 = 0x0b;
    p_regs->ADSSTR5 = 0x0b;
    p_regs->ADSSTR6 = 0x0b;
    p_regs->ADSSTR7 = 0x0b;

    if (unit == 1)  /* These register are only in channel1 */
    {
        p_regs->ADSSTRL = 0x0b;
        p_regs->ADSSTRT = 0x0b;
        p_regs->ADSSTRO = 0x0b;
    }
    
    if (unit == 0)  /* This register is only in channel0 */
    {
        S12AD.ADSHMSR.BYTE = 0;
        S12AD.ADSHCR.WORD = 0x0018;
    }

    p_regs->ADDISCR.BYTE = 0;
    p_regs->ADGSPCR.WORD = 0;

    p_regs->ADCMPCR.BYTE = 0;
    p_regs->ADCMPANSR0.WORD = 0;

    if (unit == 1)  /* These register are only in channel1 */
    {
        p_regs->ADCMPANSR1.WORD = 0;
        p_regs->ADCMPANSER.BYTE = 0;
    }
    p_regs->ADCMPLR0.WORD = 0;

    if (unit == 1)  /* These register are only in channel1 */
    {
        p_regs->ADCMPLR1.WORD = 0;
        p_regs->ADCMPLER.BYTE = 0;
    }

    p_regs->ADCMPDR0 = 0;
    p_regs->ADCMPDR1 = 0;
    u16_dummy = p_regs->ADCMPSR0.WORD;
    p_regs->ADCMPSR0.WORD = 0;          /* target bit clear by read-modify-write */

    if (unit == 1)  /* These register are only in channel1 */
    {
        u16_dummy = p_regs->ADCMPSR1.WORD;
        p_regs->ADCMPSR1.WORD = 0;      /* target bit clear by read-modify-write */
        u8_dummy = p_regs->ADCMPSER.BYTE;
        p_regs->ADCMPSER.BYTE = 0;      /* target bit clear by read-modify-write */
    }
    
    /* SET MODE RELATED REGISTER FIELDS */

    g_dcb[unit].mode = mode;
    if ((mode == ADC_MODE_SS_MULTI_CH_GROUPED)
     || (mode == ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A))
    {
        p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
    }
    else
    {
        if ((mode == ADC_MODE_CONT_ONE_CH) || (mode == ADC_MODE_CONT_MULTI_CH))
        {
            p_regs->ADCSR.BIT.ADCS = ADC_ADCS_CONT_SCAN;
        }
        // other modes have ADCS=0
    }

    if ((mode == ADC_MODE_SS_ONE_CH_DBLTRIG)
     || (mode == ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A))
    {
        p_regs->ADCSR.BIT.DBLE = 1;         // enable double trigger
    }


    /* SET TRIGGER AND INTERRUPT PRIORITY REGISTER FIELDS */

    if (p_cfg->trigger != ADC_TRIG_SOFTWARE)
    {
        p_regs->ADSTRGR.BIT.TRSA = p_cfg->trigger;
    }

    if (p_cfg->trigger == ADC_TRIG_ASYNC_ADTRG)
    {
        p_regs->ADCSR.BIT.EXTRG = 1;        // set ext trigger for async trigger
    }

    if (p_regs->ADCSR.BIT.ADCS == ADC_ADCS_GROUP_SCAN)
    {
        p_regs->ADSTRGR.BIT.TRSB = p_cfg->trigger_groupb;
        if (unit == 0)
        {
            IPR(S12ADC0,S12GBADI0) = p_cfg->priority_groupb;
        }
        else
        {
            IPR(S12ADC1,S12GBADI1) = p_cfg->priority_groupb;
        }
    }

    if (unit == 0)
    {
        IPR(S12ADC0,S12ADI0) = p_cfg->priority;
    }
    else
    {
        IPR(S12ADC1,S12ADI1) = p_cfg->priority;
    }


    /* SET REGISTER FIELDS FOR REMAINING PARAMETERS */

    p_regs->ADCER.BIT.ADPRC = p_cfg->resolution;      // must all be separate
    p_regs->ADCER.BIT.ADRFMT = (p_cfg->alignment == ADC_ALIGN_LEFT) ? 1 : 0;
    p_regs->ADCER.BIT.ACE = (p_cfg->clearing == ADC_CLEAR_AFTER_READ_ON) ? 1 : 0;
    p_regs->ADADC.BYTE = p_cfg->add_cnt;


    /* SAVE CALLBACK FUNCTION POINTER */
    g_dcb[unit].callback = p_callback;


    /* MARK DRIVER AS OPENED */
    g_dcb[unit].opened = true;
    R_BSP_HardwareUnlock(ADC_LOCK(unit));

    return ADC_SUCCESS;
}


/******************************************************************************
* Function Name: adc_check_open_cfg
* Description  : If Parameter Checking is enabled, this function will simply
*                validate the parameters passed to the adc_open function.
** Arguments    : unit -
*                    0 or 1
*                mode -
*                    Operational mode (see enumeration below)
*                p_cfg-
*                    Pointer to configuration structure (see below)
*                p_callback-
*                    Optional pointer to function called from interrupt when
*                    a scan completes
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    mode or element of p_cfg structure has invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon mode
*******************************************************************************/
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
static adc_err_t adc_check_open_cfg(uint8_t                unit,
                                    adc_mode_t const       mode,
                                    adc_cfg_t * const      p_cfg,
                                    void         (* const  p_callback)(void *p_args))
{

    /* Check for valid argument values */
    if (unit > 1)                           // unit is not enum value(can't check by a Compiler)
    {
        return ADC_ERR_INVALID_ARG;
    }
    if (p_cfg->priority > BSP_MCU_IPL_MAX)  // priority is not enum value(can't check by a Compiler)
    {
        return ADC_ERR_INVALID_ARG;
    }

    /* If interrupt driven, must have callback function */
    if ((p_cfg->priority != 0)
     && ((p_callback == NULL) || (p_callback == FIT_NO_FUNC)))
    {
        return ADC_ERR_ILLEGAL_ARG;
    }


    /* In double trigger mode, SW and async triggers not allowed */
    if ((mode == ADC_MODE_SS_ONE_CH_DBLTRIG)
     && ((p_cfg->trigger == ADC_TRIG_SOFTWARE) || (p_cfg->trigger == ADC_TRIG_ASYNC_ADTRG)))
    {
        return ADC_ERR_ILLEGAL_ARG;
    }


    /* Group checking; only synchronous triggers allowed; must be unique */

    if ((mode == ADC_MODE_SS_MULTI_CH_GROUPED) || (mode == ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A))
    {
        if ((p_cfg->trigger == ADC_TRIG_ASYNC_ADTRG)
         || (p_cfg->trigger_groupb == ADC_TRIG_ASYNC_ADTRG)
         || (p_cfg->trigger == p_cfg->trigger_groupb)
         || (p_cfg->trigger == ADC_TRIG_SOFTWARE)
         || (p_cfg->trigger_groupb == ADC_TRIG_SOFTWARE))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

