aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_s12ad_rx/src/targets/rx71m/r_s12ad_rx71m.c
    /* Verify at least one unique bonded channel is selected for Group B
     * and GroupA priority setting is valid.
     */
    if (p_regs->ADCSR.BIT.ADCS == ADC_ADCS_GROUP_SCAN)
    {
        if ((p_config->chan_mask_groupb == 0)
         || ((p_config->chan_mask_groupb & ADC_INVALID_CH_MASK(unit)) != 0))
        {
            return ADC_ERR_INVALID_ARG;
        }
        else if ((p_config->chan_mask & p_config->chan_mask_groupb) != 0)
        {
            return ADC_ERR_ILLEGAL_ARG;         // same chan in both groups
        }
        else
        {
            tmp_mask = p_config->chan_mask_groupb;
        }
    }
    else
    {
        /* for addition mask checking */
        if (0 != p_config->chan_mask_groupb)
        {
            return ADC_ERR_INVALID_ARG;
        }

        /* PGS bit must be set when group scan mode */
        if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
        {
            return ADC_ERR_INVALID_ARG;
        }
    }

    /* If sensors specified, verify in legal configuration */
    if ((p_config->chan_mask & ADC_MASK_SENSORS) || (p_config->chan_mask_groupb & ADC_MASK_SENSORS))
    {
        if ((unit == 0)
         || (S12AD1.ADCSR.BIT.DBLE == 1)       // double trigger mode
         || (S12AD1.ADDISCR.BYTE != 0)         // disconnect detection assist enabled
         || (p_config->anex_enable == true))   // external amplifier enabled
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    /* If ANEX enabled verify no group modes, no self-diagnosis (below), no DDA, no sensors (above) */
    if (p_config->anex_enable == true)
    {
        if ((p_regs->ADCSR.BIT.ADCS == ADC_ADCS_GROUP_SCAN)
         || (p_regs->ADDISCR.BYTE != 0)
         || (unit == 0)                         // cannot use unit 0
         || (p_config->chan_mask & 0x1FFF00))   // cannot use channels 8-20
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    /* Addition mask should not include bits from inactive channels */
    if (p_regs->ADADC.BIT.ADC != ADC_ADD_OFF)
    {
        tmp_mask |= p_config->chan_mask;        // tmp_mask is Group A and B combined
        // Bit-AND with 1s-complement
        if ((p_config->add_mask & ~tmp_mask) != 0)
        {
            return ADC_ERR_INVALID_ARG;
        }
    }
    else
    {
        // WARNING! Other features messed up if add_mask is non-zero when addition is turned off!
        p_config->add_mask = 0;
    }

    /* Verify only 1 bit is set in default/Group A mask */
    if ((g_dcb[unit].mode == ADC_MODE_SS_ONE_CH)
     || (g_dcb[unit].mode == ADC_MODE_CONT_ONE_CH)
     || (p_regs->ADCSR.BIT.DBLE == 1))          // double trigger mode
    {
        tmp_mask = p_config->chan_mask;         // tmp_mask is non-Group/Group A chans
        // Bit-AND with 2s-complement (see note in function header)
        if ((tmp_mask & (~tmp_mask + 1)) != tmp_mask)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    if (p_config->sample_hold_mask != 0)
    {
        if (unit == 1)                          // S&H only on unit 0
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* S&H chans can only be 0,1,2 and must have at least minimum state count specified */
        if ((p_config->sample_hold_mask > 0x7)
         || (p_config->sample_hold_states < ADC_SST_SH_CNT_MIN))
        {
            return ADC_ERR_INVALID_ARG;
        }

        /* S&H channels cannot not be split across groups */
        a_mask = p_config->sample_hold_mask & p_config->chan_mask;
        b_mask = p_config->sample_hold_mask & p_config->chan_mask_groupb;
        if (S12AD.ADCSR.BIT.ADCS == ADC_ADCS_GROUP_SCAN)
        {
            if ((a_mask != p_config->sample_hold_mask) && (b_mask != p_config->sample_hold_mask))
                return ADC_ERR_ILLEGAL_ARG;
        }
        else if (a_mask != p_config->sample_hold_mask)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }


        /* S&H channels cannot be a double trigger channel (can be in group B) */
        if ((S12AD.ADCSR.BIT.DBLE == 1) && (a_mask != 0))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* S&H channels cannot be in GroupB if GroupA priority enabled */
        if ((b_mask != 0) && (p_config->priority_groupa != ADC_GRPA_PRIORITY_OFF))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    if ((p_config->diag_method != ADC_DIAG_OFF)
     &&   ((p_regs->ADADC.BIT.ADC != 0)         // addition
        || (p_regs->ADCSR.BIT.DBLE == 1)        // double trigger mode
        || (p_config->anex_enable == true)      // ANEX
        || (p_regs->ADCMPCR.BIT.CMPIE == 1)))   // comparator
    {
        return ADC_ERR_ILLEGAL_ARG;
    }


    return ADC_SUCCESS;
}
#endif


/******************************************************************************
* Function Name: adc_configure_sensors
* Description  : This function set the sensor bits taking into account group
*                inclusion and addition/average mode.
* Arguments    : p_config -
*                   The configuration argument passed to ADC_CMD_ENABLE_CHANS.
* Return Value : none
*******************************************************************************/
static void adc_configure_sensors(adc_ch_cfg_t   *p_config)
{

    /* TEMPERATURE SENSOR */

    if ((p_config->chan_mask & ADC_MASK_TEMP) || (p_config->chan_mask_groupb & ADC_MASK_TEMP))
    {
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
        MSTP(TEMPS) = 0;
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

        if (p_config->chan_mask & ADC_MASK_TEMP)
        {
            S12AD1.ADEXICR.BIT.TSSA = 1;            // select temperature output to GroupA
            S12AD1.ADEXICR.BIT.TSSB = 0;
        }
        else
        {
            S12AD1.ADEXICR.BIT.TSSA = 0;
            S12AD1.ADEXICR.BIT.TSSB = 1;            // select temperature output to GroupB
        }

        S12AD1.ADEXICR.BIT.TSSAD = (p_config->add_mask & ADC_MASK_TEMP) ? 1 : 0;

        TEMPS.TSCR.BIT.TSEN = 1;                    // enable temp sensor

        if (1 != TEMPS.TSCR.BIT.TSEN)
        {
            /* Dommy read and compare */
            nop();
        }

        /* 30us delay */
        R_BSP_SoftwareDelay(30, BSP_DELAY_MICROSECS);

        TEMPS.TSCR.BIT.TSOE = 1;                    // enable temp sensor output to adc
    }


